app/controllers/sessions_controller.rb

    def create
        # lookup the user in the database
        @user = User.find_by(email: user_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@gmail.com"], ["LIMIT", 1]]